turbo-monorepo/components/CompaaS-Bench/artillery.yaml
config:
  target: "http://127.0.0.2:8080/@"
  phases:
    - duration: 60
      arrivalRate: 100
      name: Warm up
    - duration: 120
      arrivalRate: 200
      rampTo: 5000
      name: Ramp up load
    - duration: 600
      arrivalRate: 1000
      name: Sustained load

scenarios:
  - name: Echo Test
    engine: ws 
    flow:
      - loop:
        - send:
            type: "Echo"
            msg: "hello"
        count: 100